<template>
    
    <div class="accountAbout"> 
        <public-top></public-top>
        <div class="matchInfo" style="margin:0 auto;padding:20px">
        <!-- <div class="el-icon-d-arrow-left" style="position:absolute;left:5px;top:10px;z-index:10;z-index:10" @click="lastPage"></div>   -->
            <div>
                <p class="accountAbout_text"><span style="font-weight:bold">马拉松报名用户协议:</span>
                杭州跑跑网络科技有限公司（以下称“跑跑”或“我们”）为马拉松报名 App（以下称“马拉松报名”或“本应用”）的实际开发者和运营者。跑跑成立以来专注于服务广大跑者开发及运营APP“马拉松报名”及微信公众号“马拉松报名”，为广大跑友提供更新的赛事新闻及报名信息，服务了数以万计的跑友，现合作的马拉松: 衡水湖国际马拉松、西昌国际马拉松、临沂国际马拉松、温州国际马拉松、泰山国际马拉松、营口国际马拉松、长城国际马拉松、丽水国际马拉松、宁波马拉松、镇江国际马拉松等；公司也致力于合作更多著名的国外赛事，东京马拉松也已签订了合作协议。用户通过马拉松报名app能轻松实现查询全面详细的赛事信息、一键报名、查询及管理所有参与的赛事和相应成绩。本用户协议构成我们与马拉松报名用户（以下称”用户”或”您”）之间就马拉松报名 App提供的上述服务等事宜订立的契约，请仔细阅读本用户协议。 
                您下载马拉松报名并注册成为马拉松报名用户后，即表示您同意接受本用户协议的约束，而本用户协议即构成对双方具有约束力的法律文件。
                </p>
            </div>
            <div>
            <p class="accountAbout_protocol"> 一.用户协议的确认及接受</p>
            <p class="accountAbout_text"><p class="accountAbout_text">&nbsp;&nbsp;1.1 马拉松报名及其各项电子服务的所有权和运营权归跑跑所有。您同意用户协议并完成注册程序后，即成为马拉松报名的正式用户。用户确认：本用户协议是处理双方权利义务的契约，自始有效，法律另有强制性规定或双方另有特别约定的，从其规定。 
                <br><br>&nbsp;	&nbsp;1.2 您点击同意本用户协议，即视为您确认自己已具有与享受本应用提供的各项服务相对应的权利能力和行为能力，并能够独立承担法律责任。 
                <br> <br>&nbsp;	&nbsp;1.3 如果您要通过本应用进行有关训练，请务必在训练前确认您的身体状况适宜该训练，否则由此引起的一切风险、损害及责任等，由您自行承担。 如果您未满18周岁，您须在在父母或监护人的监护参与下才能使用本应用的有偿服务项目。 
                <br> <br>&nbsp;	&nbsp;<span style="font-weight:bold"> 1.4 跑跑保留在中华人民共和国大陆地区法现行法律法规允许的范围内自行决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单等的权利。
                </span>
                <br> <br>&nbsp;	&nbsp;1.5 马拉松报名的软件著作权及其发布的所有信息与内容的版权均受中华人民共国著作权法（含相关法律、法规）乃至世界版权法律的保护，仅供用户因自身学习、调研等目的免费使用。严禁未经授权对本应用内容进行复制、发行、出租、展览、放映、广播、修改、演绎、翻译、汇编、改编或逆向工程。杭州跑跑网络科技有限公司保留所有未在本用户协议中明确授予的权利。
                <br> <br>&nbsp;	&nbsp;1.6 跑跑通过互联网依法为用户提供互联网信息等服务，您在完全同意本用户协议及马拉松报名其他规定的情况下，方有权使用马拉松报名的相关服务。
                <br> <br>&nbsp;	&nbsp;1.7 用户必须自行准备如下设备并承担如下开支：（1）上网设备，包括并不限于智能手机、电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。
            </p>
        </div>
        <div>
            <p class="accountAbout_protocol">二. 马拉松报名账号注册规则</p> 
            <p class="accountAbout_text">
                <br><span style="font-weight:bold">  2.1 马拉松报名账号注册资料包括但不限于用户的账号名称、头像、密码、注册或更新账号时输入的所有信息以及您在马拉松报名进行赛事报名时所填写的所有信息（包括但不限于姓名、地址、联系电话等）。</span>
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;2.2 在注册马拉松报名账号时，用户应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且保证在注册及使用马拉松报名账号时，不得有以下情形： 
                                    （1）违反宪法或法律法规规定的； 
                                    （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 
                                    （3）损害国家荣誉和利益的，损害公共利益的； 
                                    （4）煽动民族仇恨、民族歧视，破坏民族团结的； 
                                    （5）破坏国家宗教政策，宣扬邪教和封建迷信的； 
                                    （6）散布谣言，扰乱社会秩序，破坏社会稳定的； 
                                    （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 
                                    （8）侮辱或者诽谤他人，侵害他人合法权益的； 
                                    （9）含有法律、行政法规禁止的其他内容或违反马拉松报名的其他规定的。 

                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">2.3 用户应保证其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新。因用户提供的注册资料不符合本协议约定而引起的一切责任及后果（包括但不限于不予注册、账户停用或注销等），由用户自行承担，且跑跑保留终止用户使用马拉松报名各项服务的权利。</span>
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;2.4 用户以虚假信息骗取账号名称注册，或其账号头像、简介等注册信息存在违法和不良信息的，跑跑有权采取通知限期改正、暂停使用、注销登记等措施。 
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">2.5 对冒用、关联机构或社会名人注册账号名称的用户，跑跑有权注销其账号，并向互联网信息内容主管部门报告。 </span>
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;2.6 用户在使用本应用服务时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，我们将予以严格保密，除非得到用户的授权或法律另有规定，我们不会向外界披露。 
                <br><br>2.7 用户成功注册后，将产生用户名和密码等账户信息，您可以根据马拉松报名的规定更改您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知我们并向公安机关报案。因用户未妥善保管其账户名称及密码而导致第三人使用账户而给用户造成的损失，由用户自行承担。 
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp; 2.8 您的马拉松报名账户仅限于您自己使用，切勿将您的马拉松报名账户允许第三人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp;2.9 依据相关法律法规的规定，跑跑有权对注册用户进行基于移动电话号码、电子邮箱、微信等真实身份信息认证。对于拒绝进行真实身份信息认证的用户，跑跑保留拒绝此用户使用马拉松报名相关服务的权利并有权对用户进行包括但不限于限制服务使用、关闭账号等的处理。
                </p>
        </div>
        <div>
            <!-- 改到这里 -->
            <p class="accountAbout_protocol">三.用户管理</p>
            <p class="accountAbout_text">&nbsp;&nbsp; 3.1 用户必须遵守中华人民共和国及国际相关法律法规的规定，独立对其发布的内容（包括但不限于文字、图片等）承担责任。用户承诺： 
                （1）用户在使用我们提供的服务或在马拉松报名上发布信息时必须符合中华人民共和国相关法律法规的规定，不得制作、复制、发布、传播以下内容或信息： 
                (a) 违反宪法确定的基本原则的； 
                (b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 
                (c) 损害国家荣誉和利益的； 
                (d) 煽动民族仇恨、民族歧视，破坏民族团结的； 
                (e) 破坏国家宗教政策，宣扬邪教和封建迷信的； 
                (f) 散布谣言，扰乱社会秩序，破坏社会稳定的； 
                (g) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的； 
                (h) 侮辱或者诽谤他人，侵害他人合法权益的； 
                (i) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； 
                (j) 以非法民间组织名义活动的； 
                (k) 含有法律、行政法规禁止的其他内容或违反马拉松报名的其他规定的。 
                （2）用户在使用我们提供的服务或在我们提供的平台上发布信息时还必须符合其他有关国家和地区的法律规定以及国际法的有关规定。       
                <br><br>&nbsp;&nbsp;3.2 用户理解并同意，其在马拉松报名上发布的任何信息（包括但不限于文字、图片等），均已自动授权跑跑或马拉松报名在包含宣传推广在内的各个合法途径使用。若用户对跑跑里或马拉松报名使用信息的方式存有异议，应在发现后及时联系我们进行沟通解决，若用户未对跑跑或马拉松报名的使用行为提出异议，则默认其同意此种使用行为且无权就上述使用主张权利。 
                <br><br> &nbsp;&nbsp;3.3 用户不得以任何方式干扰马拉松报名服务且不得通过马拉松报名发布任何形式的广告，马拉松报名对用户发布的广告内容有权进行包括但不限于删除内容直至关闭账号的处理。因网络信息传播在时间上的即时性及空间上的广泛性，我们不可能在第一时间对用户发布广告的行为进行处理，在此提请用户需对此种广告的内容自行甄别，因用户受此种广告内容的影响而产生的任何损失，均与跑跑或马拉松报名无关。马拉松报名鼓励用户对上述广告发布行为进行举报，我们会在收到举报后及时处理。
                <br><br> &nbsp;&nbsp;3.4 责任承担 
                <br> <br>&nbsp;&nbsp;&nbsp;	&nbsp;（1）用户须对自己在使用马拉松报名服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在跑跑首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予跑跑等额的赔偿。若用户违反以上规定，我们有权作出独立判断立即暂停或终止对用户提供部分或全部服务，包括锁定、注销、删除用户马拉松报名账号等措施。 
                <br><br>&nbsp;&nbsp;&nbsp;&nbsp; （2）用户理解，如果马拉松报名发现其发布的信息明显属于本条第（1）款所列内容之一，依据中华人民共和国现行相关法律，马拉松报名有义务立即停止传输，保存有关记录，向国家有关机关报告，并且删除含有该内容的地址、目录或关闭服务器。
            </p>
        </div>
        <div>
            <p class="accountAbout_protocol">四.用户隐私制度 </p>
            <p class="accountAbout_text">&nbsp;&nbsp;4.1 用户知悉并同意，为了记录用户训练的真实数据以及给用户提供赛事报名等相关服务，我们在您自愿的前提下收集您的个人信息并将这些信息进行整合，包括但不限于注册账号时的相关信息、个人身体数据（身高、体重、健康数据等）、GPS定位数据、收货人的姓名、地址、电话等。 
            <br><br>&nbsp;&nbsp;; a)4.2 尊重用户个人隐私是马拉松报名的一项基本政策。所以，马拉松报名不会公开或向任何第三方透露用户的注册资料以及用户因享受马拉松报名服务而提供的任何信息，但以下情形除外：（1）事先获得用户的明确授权或许可； 
            （2）遵守有关法律规定，包括在国家有关机关查询时，提供用户的注册信息、用户在马拉松报名发布的信息内容及其发布时间、互联网地址或者域名等； 
            （3）在紧急情况下竭力维护用户个人和社会大众的隐私安全； 
            （4）根据本条款相关规定或者马拉松报名认为必要的其他情形。 
            马拉松报名可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与马拉松报名同等的保护用户隐私的责任，则马拉松报名可将用户信息提供给该第三方。
            </p>
        </div>
        <div>
            <p class="accountAbout_protocol"> 五.电商服务</p>
            <p class="accountAbout_text"> &nbsp;&nbsp;为满足用户对马拉松周边产品的需求，马拉松报名将在未来的版本中向用户提供电商服务，相关的电商服务条款亦将择时发布。
            </p>
        </div>
        <div>
            <p class="accountAbout_protocol" >六.所有权及知识产权条款</p>
            <p class="accountAbout_text">
                <br><br>&nbsp;&nbsp;6.1 用户一旦接受本用户协议，即表明该用户主动将其在马拉松报名及其相关平台上发表的任何形式的信息内容（包括但不限于用户评论、用户咨询、各类话题文章、训练图片等）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利）等，全部独家且不可撤销地转让给跑跑所有，用户同意跑跑有权就任何主体侵权而单独提起诉讼。 
                <br><br>&nbsp;&nbsp;6.2 本条款已经构成《中华人民共和国著作权法》第二十五条及相关法律规定的著作财产权等权利转让的书面协议，其效力及于用户在马拉松报名上发布的任何受著作权法保护的作品内容，无论该等内容形成于本用户协议订立前还是订立后。
                <br><br>&nbsp;&nbsp;6.3 用户同意并已充分了解本条款的含义，承诺不将已发表于马拉松报名的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。 
                <br><br>&nbsp;&nbsp;6.4 跑跑（含其关联企业）是马拉松报名App的所有者及运营者，拥有马拉松报名App内容、资源及软件的著作权等合法权利，受国家法律保护，有权不时地对本用户协议、马拉松报名App版本及内容进行修改或更新，并在App内张贴或直接更新，无须另行通知用户。在法律允许的最大限度范围内，跑跑（含其关联企业）对本协议及马拉松报名 App内容拥有解释权。
                <br><br>&nbsp;&nbsp;6.5 除法律另有强制性规定外，未经跑跑（含其关联企业）明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用马拉松报名内的信息内容，否则，跑跑有权追究其法律责任。
                <br><br>&nbsp;&nbsp;6.6 马拉松报名所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、 数字下载、数据编辑和软件），均是跑跑或其内容提供者的财产，受中华人民共和国和国际版权法及相关法律法规的保护；上述内容的汇编是跑跑的排他财产，受中华人民共和国和国际版权法及相关法律法规的保护；马拉松报名所有版本都是跑跑（含其关联公司）的财产，受中华人民共和国和国际版权法及相关法律法规的保护。  
            </p>
        </div>
        <div>
            <p class="accountAbout_protocol" >七.责任限制及不承诺担保</p>
            <p class="accountAbout_text">&nbsp;	&nbsp;<span style="font-weight:bold">7.1 除非另有明确的书面说明，马拉松报名提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在”按现状”和”按现有”的基础上提供的。</span>
                <br><br><br>&nbsp;	&nbsp;7.2 除非另有明确的书面说明，我们不对马拉松报名的运营及其包含的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。 
                <br><br>&nbsp;	&nbsp; 7.3 我们不担保马拉松报名所包含的或以其它方式通过马拉松报名提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从马拉松报名发出的电子信件、信息没有病毒或其他有害成分。</p>
                <br><br>&nbsp;	&nbsp;7.4 如因不可抗力或其它我们无法控制的原因使本应用的服务系统崩溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的信息、记录等，我们会合理地尽力协助处理善后事宜。
            
    
                <p class="accountAbout_protocol">八.协议更新及用户关注义务</p>
                <p class="accountAbout_text">&nbsp;	&nbsp;<span>根据国家法律法规的更新及实际运营需要，我们有权对本协议不时地进行修改，修改后的用户协议在马拉松报名上一经公布即生效力，并代替原来的用户协议。用户可随时登录查阅最新用户协议内容。如用户不同意更新后的用户协议，应立即停止接受本应用提供的服务；如用户继续使用本应用提供的服务，即视为同意更新后的用户协议。我们建议您在使用本应用前阅读本用户协议及有关公告。如果本用户协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</span></p>
                <p class="accountAbout_protocol">九.法律管辖和适用</p>
                <p class="accountAbout_text">&nbsp;	&nbsp;<span style="font-weight:bold">本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。 如发生本用户协议的某些内容与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉</span></p>

        </div>
        </div>   
    </div>
</template>
<style scoped>
/* @import './accountAbout.css'; */
div{
    margin: 0;
    color: #484646;
}
.accountAbout{
    margin: 0;
    color: #484646;
    overflow-x: hidden;
}
.accountAbout_protocol{
    margin-left: 0.9rem;
    width: 100%;
    font-size: 1.2rem;
    font-weight: bold;
    text-align: left;
}
.accountAbout_tip{
    padding-top: 1.0rem;
}
.accountAbout_text{
    text-align: left;
    margin: 1.1rem;
}
</style>
<script>
    import publicTop from "./publicTop.vue"
    import processTab from "./processTab.vue";
    export default {
        name: 'accountAbout',
        data(){
            return{

            }       
        },
        components: {
            publicTop, 
            processTab           
        }, 
        methods:{ 
                      
        }
    }
   
</script>